remove mermaid diagram
